In [57]:
import pandas as pd
import numpy as np

In [58]:
df=pd.read_excel('./Datasets/datac.xlsx')

In [59]:
df

     Name       Date  Marks  Experience  Qualification
0  Nabeel 2020-12-01    NaN         3.0            2.0
1     Ali 2020-12-02  450.0         4.0            1.0
2   Ahmad 2020-12-03  350.0         5.0            NaN
3   Maria        NaT  300.0         2.0            2.0
4   Aamir 2020-12-05  489.0         NaN            1.0

In [60]:
df=df.iloc[:,2:5]
df

   Marks  Experience  Qualification
0    NaN         3.0            2.0
1  450.0         4.0            1.0
2  350.0         5.0            NaN
3  300.0         2.0            2.0
4  489.0         NaN            1.0

In [61]:
df=df.fillna(df.median())
df

   Marks  Experience  Qualification
0  400.0         3.0            2.0
1  450.0         4.0            1.0
2  350.0         5.0            1.5
3  300.0         2.0            2.0
4  489.0         3.5            1.0

## NUMPY is using axis=0 fo column and axis=1 for row

In [51]:
df.apply(np.sqrt)

       Marks  Experience  Qualification
0  20.000000    1.732051       1.414214
1  21.213203    2.000000       1.000000
2  18.708287    2.236068       1.224745
3  17.320508    1.414214       1.414214
4  22.113344    1.870829       1.000000

In [66]:
df.apply(np.sum)

Marks            1989.0
Experience         17.5
Qualification       7.5
dtype: float64

In [68]:
df.apply(np.sum, axis=1)

0    405.0
1    455.0
2    356.5
3    304.0
4    493.5
dtype: float64

In [69]:
df

   Marks  Experience  Qualification
0  400.0         3.0            2.0
1  450.0         4.0            1.0
2  350.0         5.0            1.5
3  300.0         2.0            2.0
4  489.0         3.5            1.0

In [72]:
df=df.applymap(lambda x: x**2)

In [73]:
df

      Marks  Experience  Qualification
0  160000.0        9.00           4.00
1  202500.0       16.00           1.00
2  122500.0       25.00           2.25
3   90000.0        4.00           4.00
4  239121.0       12.25           1.00